{
  "es": {
    "language1": "Español",
    "language2": "Ingles",
    "header_h1": "Desarrollador de Software",
    "header_name": "Sebastián Ladino",
    "header_position": "Desarrollador Full Stack",
    "exp_title": "Experiencia",
    "exp_position1": "Desarrollador Jr .NET",
    "exp_date1": "Julio 2024 - Enero 2025 (Prácticas Laborales)",
    "exp_funciones11": "Responsable de la planificación y análisis de requerimientos para el desarrollo de nuevas aplicaciones internas de la compañía.",
    "exp_funciones12": "Diseño y creación de bases de datos en SQL Server (DDLs), utilizando EF Core y ADO.NET para el acceso a datos.",
    "exp_funciones13": "Gestión de cambios en el esquema mediante migraciones, y optimización de consultas mediante LINQ para un acceso eficiente y escalable.",
    "exp_funciones14": "Desarrollo e implementación de aplicaciones web utilizando ASP.NET Core MVC, Razor Pages y Web API, asegurando soluciones escalables y eficientes.",
    "exp_funciones15": "Mantenimiento de aplicaciones existentes, proporcionando soporte tanto para clientes internos como externos de la empresa.",
    "exp_funciones16": "Coordinación y ejecución de despliegues en entornos de pruebas para validación y verificación de las aplicaciones con clientes internos y externos.",
    "exp_funciones17": "Implementación de despliegues en entornos productivos, gestionando la resolución de vulnerabilidades identificadas durante los escaneos de seguridad.",
    "skills_title": "Tecnologías",
    "skills_subtitle": "Estas son alguna de las tecnologías y herramientas que he utilizado en el desarrollo de los diferentes proyectos y experiencias laborales en las que he trabajado.",
    "skills_card3": "Herramientas",
    "projects_title": "Proyectos",
    "projects_subtitle": "Estos son algunos de los proyectos en los que he trabajado tanto individualmente como en equipo, a lo largo de mi formación académica y experiencia laboral.",
    "projects_name1": "Sistema de Digitación",
    "projects_description1": "Aplicación web diseñada para optimizar la digitalización de documentos jurídicos, facilitando la organización, almacenamiento y acceso seguro a información legal en formato digital.",
    "projects_name2": "Sistema de Inventario DDNE",
    "projects_description2": "Aplicación web personalizada para la gestión integral de inventarios, clientes, proveedores y productos. Esta herramienta fue diseñada para satisfacer las necesidades específicas de control y administración de la empresa.",
    "projects_name3": "Sistema de Reportes",
    "projects_description3": "Aplicación web diseñada para gestionar y monitorear reportes de novedades dentro de la empresa. Facilita un seguimiento eficiente y garantiza una respuesta ágil del área responsable, optimizando la comunicación y resolución de incidencias.",
    "about_title": "Acerca de mí",
    "about_description1": "Hola, soy Sebastián Ladino. Llevo más de 2 años construyendo aplicaciones web full stack y APIs utilizando tecnologías como JavaScript y .NET. Mi enfoque principal está en la creación de interfaces, aunque también disfruto desarrollando la lógica de negocio en el backend.",
    "about_description2": "He tenido la oportunidad de trabajar en proyectos tanto empresariales como educativos, siempre buscando el equilibrio entre estética y funcionalidad para ofrecer la mejor experiencia de usuario. Me apasiona resolver problemas complejos y siempre busco mejorar las soluciones existentes.",
    "about_description3": "Estoy interesado en unirme a un equipo de trabajo que me permita seguir creciendo profesionalmente. Si tienes un proyecto interesante en mente, no dudes en ponerte en contacto conmigo.",
    "cv_donwload": "Descargar CV",
    "contact_title": "Contáctame",
    "contact_description": "Si deseas contactarme para colaborar en un proyecto, compartir ideas o simplemente saludar, no dudes en enviarme un mensaje a través del siguiente formulario.",
    "contact_email": "Correo Electrónico",
    "contact_email_placeholder": "Ingresa tu correo electrónico para contactarte",
    "contact_message": "Mensaje",
    "contact_close": "Cancelar",
    "contact_send": "Enviar",
    "contact_success": "¡Mensaje enviado con éxito!",
    "contact_error": "¡Error al enviar el mensaje! Por favor, inténtalo de nuevo más tarde.",
    "development": "Desarrollado por Sebastián Ladino"
  },
  "en": {
    "language1": "Spanish",
    "language2": "English",
    "header_h1": "Software Developer",
    "header_name": "Sebastián Ladino",
    "header_position": "Full Stack Developer",
    "exp_title": "Experience",
    "exp_position1": "Junior .NET Developer",
    "exp_date1": "July 2024 - January 2025 (Internship)",
    "exp_funciones11": "Responsible for planning and analyzing requirements for the development of new internal applications for the company.",
    "exp_funciones12": "Design and creation of databases in SQL Server (DDLs), using EF Core and ADO.NET for data access.",
    "exp_funciones13": "Managing schema changes through migrations, and optimizing queries using LINQ for efficient and scalable access.",
    "exp_funciones14": "Development and implementation of web applications using ASP.NET Core MVC, Razor Pages, and Web API, ensuring scalable and efficient solutions.",
    "exp_funciones15": "Maintenance of existing applications, providing support for both internal and external company clients.",
    "exp_funciones16": "Coordination and execution of deployments in test environments for validation and verification of applications with internal and external clients.",
    "exp_funciones17": "Implementation of deployments in production environments, managing the resolution of vulnerabilities identified during security scans.",
    "skills_title": "Technologies",
    "skills_subtitle": "These are some of the technologies and tools I have used during the development of the different projects and work experiences I have worked on.",
    "skills_card3": "Tools",
    "projects_title": "Projects",
    "projects_subtitle": "These are some of the projects I have worked on, both individually and as part of a team, throughout my academic training and work experience.",
    "projects_name1": "Digitization System",
    "projects_description1": "A web application designed to optimize the digitization of legal documents, facilitating the organization, storage, and secure access to legal information in digital format.",
    "projects_name2": "DDNE Inventory System",
    "projects_description2": "A custom web application for the comprehensive management of inventories, clients, suppliers, and products. This tool was designed to meet specific needs for control and administration for the company.",
    "projects_name3": "Reporting System",
    "projects_description3": "A web application designed to manage and monitor incident reports within the company. It enables efficient tracking and ensures a swift response from the responsible department, optimizing communication and issue resolution.",
    "about_title": "About Me",
    "about_description1": "Hello, I am Sebastián Ladino. I have over 2 years of experience building full stack web applications and APIs using technologies like JavaScript and .NET. My main focus is on creating interfaces, although I also enjoy developing business logic on the backend.",
    "about_description2": "I have had the opportunity to work on both business and educational projects, always striving for the balance between aesthetics and functionality to provide the best user experience. I am passionate about solving complex problems and constantly looking to improve existing solutions.",
    "about_description3": "I am interested in joining a team that allows me to continue growing professionally. If you have an interesting project in mind, feel free to reach out to me.",
    "cv_donwload": "Download CV",
    "contact_title": "Contact Me",
    "contact_description": "If you'd like to contact me for a project collaboration, share ideas, or simply say hello, feel free to send me a message through the form below.",
    "contact_email": "Email Address",
    "contact_email_placeholder": "Enter your email address to contact you",
    "contact_message": "Message",
    "contact_close": "Cancel",
    "contact_send": "Send",
    "contact_success": "Message sent successfully!",
    "contact_error": "Error sending the message! Please try again later.",
    "development": "Developed by Sebastián Ladino"
  }
}